#include <elf.h>
#include <stdio.h>
#include <stdlib.h>

void png()
{
	printf(                                                                                                                             
                                                                                                                         
    "   ,@@`          =@@.             @@^        .@@@`           .*.       =@^       .*.            .]]]]]]]]]]]]]]`         \n" \
    "    ,@@\\         =@@.             @@^          =@@^          @@^       =@^       =@@   =@@@@@@^ .@@/[[[@@/[[[\\@^       \n" \
    "     .\\@@`       =@@.             @@^   =@@@@@@@@@@@@@@@^    @@@@@@@@@@@@@@@@@@@@@@@   =@@**=@^ .@@^   @@^   =@^        \n" \
    "       .  @@@@@@@@@@@@@@@@@@^ =@@@@@@@@@.***************.                        ,[[   =@@  =@^ .@@^   @@^   =@^         \n" \
    "                 =@@              @@^    .]/^       @\\]      @@@@@@@@@@. =@@@@@@@@@@   =@@  =@^ .@@^   @@^   =@^        \n" \
    "  =@@@@@.        /@/              @@^     =@@      =@@^      @@^    *@@. =@@     =@@   =@@  =@^ .@@^   @@^   =@^         \n" \
    "     =@@.       =@@@\\             @@\\/@@^ .@@^     @@@       @@\\]]]]]@@. =@@]]]]]/@@   =@@  =@^ .@@@@@@@@@@@@@@^         \n" \
    "     =@@.      ,@@^,@@\\.      =@@@@@@[[    =@@    ,@@^       @@/[[[[[@@. =@@[[[[[\\@@   =@@  =@^ .@@^         .*.         \n" \
    "     =@@.     /@@^   ,@@@`        @@^      ,@@^   /@/        @@^    *@@. =@@     =@@   =@@]]/@^ .@@^                     \n" \
    "     =@@.  ./@@@`      ,@@@`      @@^       @@\\  =@@`       .@@@@@@@@@@. =@@@@@@@@@@   =@@[[\\@^ .@@^           /@^       \n" \
    "     =@@.,@@@/`          =@/.     @@^       ,[[  @@^        =@@     *@@. @@^     =@@   =@@  ,[` .@@^           @@^       \n" \
    "   /@@/@@\\`.                      @@^  ]]]]]]]]]/@@]]]]]]] ,@@^     ,@@.=@@.     =@@            .@@\\          =@@.       \n" \
    "  ,@@.  ,\\@@@@@@@@@@@@@@@@@@@^,@@@@@`  \\@@@@@@@@@@@@@@@@@/,@@^  =@@@@@`=@@`  \\@@@@@/             .\\@@@@@@@@@@@@@`        \n" \
    "                                                            .           .`                                               \n" \
    );
}

void before()
{
	printf("很久很久以前,巨龙突然出现,带来灾难带走了公主又消失不见!\n");
	printf("达拉崩吧斑得贝迪卜多比鲁翁勇者赶到，带上最好的剑，翻过最高的山，闯进最深的森林，誓要把公主带到国王面前！\n");
}

int menu()
{
	int choice;
	puts("\n1. 购买药水提升攻击力");
	puts("2. 攻击魔龙");
	puts("3. 展示自身属性面板");
	puts("4. 终止行动");
	printf("作出你的选择：");
	scanf("%d",&choice);
	return choice;
}

int check(int time, int money)
{
	return ((money-10*time)<0)?0:1;
}

void game()   // -128 - 127
{
	char user_strength = 10;
	char money = 20;
	char dragon_strength = 120;
	int choice,time;

	while(1)
	{
		switch(menu())
		{
			case 1:	printf("勇者，你要购买几瓶？");scanf("%d",&time);
			if(check(time,money))
			{
					user_strength += 20*time;	money -= 10*time;
			}
			else
				printf("你这点钱，我很难办事啊\n");
			break;
			case 2:
				if(user_strength > dragon_strength)
				{
					printf("你击败了魔龙！\n");
					system("/bin/sh");
				}
				else
				{
					printf("魔龙：弱小的勇者,以你%d的攻击力竟然想撼动我，接受死亡吧！\n",user_strength);
					puts("失去同步！\n");
					exit(0);
				}
				break;
			case 3:
				printf("攻击力：%d,	金钱：%d\n",user_strength,money);break;
			case 4:
				printf("任务失败！\n悲惨的公主永世被魔龙囚禁了起来！\n");exit(0);
		}
	}

}

void init()
{
	setvbuf(stdin,0,2,0);
	setvbuf(stdout,0,2,0);
	setvbuf(stderr,0,2,0);
}

int main()
{
	init();												
	png();
	before();
	game();

	return 0;
}
